using System.Windows.Controls;

namespace Shogi.RulePage
{
    /// <summary>
    /// Логика взаимодействия для MovementRulesPage.xaml
    /// </summary>
    public partial class MovementRulesPage : Page
    {
        public MovementRulesPage()
        {
            InitializeComponent();
            MovementRulesText.Text = "Правила ходів у сьогах дуже схожі на шахи. " +
                "Очередність ходу визначається випадковим чином. " +
                "Гравці роблять ходи по черзі. " +
                "Є два можливих різновида ходу: звичайний, як у шахах, коли гравець переміщає свою фігуру на дошці, " +
                "та вкидування - переміщення фігури зі своєго резерву на дошку. Фігури попадають у резерв при битті фігури: " +
                "побита фігура переміщається в резерв гравця, що побив її. вкидування має наступні правила:\r\n" +
                "-Правило ніфу (яп. 二歩 «дві пішаки»): заборонено скидати пішака на вертикаль, на якій вже стоїть неперевернений пішак того ж гравця.\r\n" +
                "-Заборонено виставляти фігуру на полі, на якому вона не матиме можливості ходу за правилами(тобто пішака чи стрілку на останню горизонталь, коня на дві останні горизонталі).\r\n" +
                "-Скидати фігури можна лише у неперевернутому(неперетвореному) вигляді.\r\n";
        }
    }
}
