using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Data;
using System.Windows.Documents;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Imaging;
using System.Windows.Navigation;
using System.Windows.Shapes;

namespace Shogi.RulePage
{
    /// <summary>
    /// Логика взаимодействия для TransformationRulesPage.xaml
    /// </summary>
    public partial class TransformationRulesPage : Page
    {
        public TransformationRulesPage()
        {
            InitializeComponent();
            TransformationRulesText.Text = "Три останні горизонталі дошки (щодо кожного гравця) є так званою «зоною перевороту» " +
                "(також замість слова переворот часто використовується термін перетворення). " +
                "Фігура, що робить хід у цю зону, хід усередині зони або з неї може бути перевернута. " +
                "Переворот не є окремим ходом, а відбувається у процесі ходу фігури на дошці. " +
                "При перетворенні фігура перевертається на інший бік, де зображено знак перетвореної фігури, " +
                "тому, на відміну від шахів, фігура, на яку відбувається перетворення, визначена правилами:\r\n" +
                "Король та золотий генерал не перетворюються.\r\n" +
                "Срібло, кінь, стрілка і пішак (ці фігури називаються молодшими) перетворюються на фігури, які ходять як золото. Щоб не плутати ці перевернуті фігури, вони мають власні назви та зображаються різними ієрогліфами.\r\n" +
                "Тура перетворюється на туру-дракона, який ходить і як тура, і як король.\r\n" +
                "Слон перетворюється на слона-дракона, який ходить і як слон, і як король.\r\n" +
                "Перетворення фігури обов'язково, якщо після ходу не перевернута фігура не могла б більше ходити за правилами; в іншому випадку гравець може вибирати між ходом із перетворенням та ходом без перетворення.\r\n" +
                "Фігура залишається перетвореною, доки не буде знята з дошки. Якщо перетворена фігура захоплюється, гравець може скинути її лише як звичайну. " +
                "Переворот при скиданні неможливий, незалежно від того, на яке поле виставляється фігура. Перетворити скинуту фігуру дозволяється не раніше наступного ходу, тому скидати фігуру на полі, з якого вона не матиме ходи за правилами, не можна.";
        }
    }
}
